blogsrc/mybatis-spring-howto.org
#+TITLE: MyBatis spring howto
#+AUTHOR: zzyong wangwenlong
#+SETUPFILE: ../setup/theme-readtheorg-local.setup

MyBatis本质上还是一个ORM框架，ORM框架的核心还是把对对象的操作，映射到对数据库的操作（感觉设计中是反过来的，把对数据库的操作封装成对对象的操作）。映射涉及到一系列选择：
1. 数据库如何表示
2. 对象的方法如何映射到SQL，成员如何映射到表的字段
3. Java数据类型如何映射到SQL的数据类型

最核心的是SqlSessionFactory，在这个类里面完成了数据库的配置，注册了需要映射的对象（在MyBatis中其实是一个接口，称其为Mapper）。Mapper定义了SQL和函数的关系。

MyBatis-Spring 是MyBatis在Spring下的封装，主要为了使用Spring的依赖注入。因为依赖注入本身依赖于约定和选择，当依赖注入的*选择*比较复杂时，需要手动介入，特别涉及到多库的时候。

