blogs/mybatis-spring-howto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MyBatis spring howto</title>
<!-- 2016-03-31 四 10:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zzyong wangwenlong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MyBatis spring howto</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Mapper 的定义</a>
<ul>
<li><a href="#sec-1-1">1.1. 从方法到SQL </a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 通过 Select Insert Update Delete 注解绑定静态SQL</a></li>
<li><a href="#sec-1-1-2">1.1.2. 通过 SelectProvider InsertProvider UpdateProvider DeleteProvider 注解绑定动态SQL</a></li>
<li><a href="#sec-1-1-3">1.1.3. 通过 Options 注解可以指定额外的选项</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 从方法的参数到SQL的参数</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 单个简单参数</a></li>
<li><a href="#sec-1-2-2">1.2.2. 多个简单参数</a></li>
<li><a href="#sec-1-2-3">1.2.3. 对象参数</a></li>
<li><a href="#sec-1-2-4">1.2.4. Map参数</a></li>
<li><a href="#sec-1-2-5">1.2.5. 查询返回值</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 区分三类数据值</a></li>
<li><a href="#sec-1-4">1.4. 动态SQL</a></li>
<li><a href="#sec-1-5">1.5. SQL注入</a></li>
</ul>
</li>
<li><a href="#sec-2">2. SqlSessionFactory</a>
<ul>
<li><a href="#sec-2-1">2.1. 构造 SqlSessionFactory</a></li>
<li><a href="#sec-2-2">2.2. 和Spring的融合</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 使用 MapperScan 发现Mapper</a></li>
<li><a href="#sec-2-2-2">2.2.2. 使用 MapperScannerConfigurer </a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 应对多个数据库 (1) </a>
<ul>
<li><a href="#sec-3-1">3.1. 多个库，Mapper不相同</a></li>
<li><a href="#sec-3-2">3.2. 多个库，Mapper相同</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 应对多个数据库 (2) </a>
<ul>
<li><a href="#sec-4-1">4.1. 自动主从分离</a></li>
<li><a href="#sec-4-2">4.2. 自动分多个库</a></li>
<li><a href="#sec-4-3">4.3. 总结</a></li>
</ul>
</li>
<li><a href="#sec-5">5. TypeHandler </a></li>
<li><a href="#sec-6">6. 缓存</a></li>
</ul>
</div>
</div>
<p>
MyBatis本质上还是一个ORM框架，ORM框架的核心还是把对对象的操作，映射到对数据库的操作（感觉设计中是反过来的，把对数据库的操作封装成对对象的操作）。映射涉及到一系列选择：
</p>
<ol class="org-ol">
<li>数据库如何表示
</li>
<li>对象的方法如何映射到SQL，成员如何映射到表的字段
</li>
<li>Java数据类型如何映射到SQL的数据类型
</li>
</ol>

<p>
最核心的是SqlSessionFactory，在这个类里面完成了数据库的配置，注册了需要映射的对象（在MyBatis中其实是一个接口，称其为Mapper）。Mapper定义了SQL和函数的关系。
</p>

<p>
MyBatis-Spring 是MyBatis在Spring下的封装，主要为了使用Spring的依赖注入。因为依赖注入本身依赖于约定和选择，当依赖注入的<b>选择</b>比较复杂时，需要手动介入，特别涉及到多库的时候。
</p>
