blogsrc/mybatis-spring-howto.org
* Mapper 的定义
Mapper是开发者关注最多的部分，先看看它是如何定义的。

#+BEGIN_SRC java
public interface EmployeeMapper {
  class Sql {
    final static String TABLE = "employee";
    final static String SELECT = "SELECT * FROM " + TABLE + " WHERE id = #{id}";
    final static String SELECT_ALL = "SELECT * FROM " + TABLE + " ORDER BY id DESC LIMIT #{limit}";
    final static String SELECT_PAGE = "SELECT * FROM " + TABLE +
      " WHERE id < #{id} ORDER BY id LIMIT #{limit}";
    final static String DELETE = "DELETE FROM " + TABLE + " WHERE id = #{id}";

    public static String selectByName(Map<String, Object> param) {
      SQL sql = new SQL().SELECT("*").FROM(TABLE)
        .WHERE("name = #{name}");
      
      Employee.Gender gender = (Employee.Gender) param.get("gender");
      if (gender != null) {
        sql.AND().WHERE("gender = #{gender}");
      }
      
      return sql.toString();
    }

    public static String insert(Employee employee) {
      SQL sql = new SQL()
        .INSERT_INTO(TABLE)
        .VALUES("name", "#{name}")
        .VALUES("phone", "#{phone}");
      if (employee.getDepartment() != null) {
        sql.VALUES("department", "#{department}");
      }
      if (employee.getPosition() != null) {
        sql.VALUES("position", "#{position}");
      }
      if (employee.getGender() != null) {
        sql.VALUES("gender", "#{gender}");
      }
      return sql.toString();
    }

    public static String update(Employee employee) {
      SQL sql = new SQL().UPDATE(TABLE);
      if (employee.getName() != null) {
        sql.SET("name = #{name}");
      }
      if (employee.getDepartment() != null) {
        sql.SET("department = #{department}");
      }
      if (employee.getPosition() != null) {
        sql.SET("position = #{position}");
      }
      if (employee.getGender() != null) {
        sql.SET("gender = #{gender}");
      }
      if (employee.getPhone() != Integer.MIN_VALUE) {
        sql.SET("phone = #{phone}");
      }
      return sql.WHERE("id = #{id}").toString();        
    }
  }

  @Select(Sql.SELECT_ALL)
  List<Employee> findAll(long limit);

  @Select(Sql.SELECT_PAGE)
  List<Employee> findPager(@Param("id") long id, @Param("limit") long limit);

  @SelectProvider(type = Sql.class, method = "selectByName")
  List<Map<String, Object>> findByName(@Param("name") String name,
                                       @Param("gender") Employee.Gender gender);

  @Select(Sql.SELECT)
  Employee find(@Param("id") long id);

  @InsertProvider(type = Sql.class, method = "insert")
  @Options(useGeneratedKeys=true, keyProperty = "id")
  int add(Employee employee);

  @UpdateProvider(type = Sql.class, method = "update")
  int update(Employee employee);

  @Delete(Sql.DELETE)
  int delete(long id);
}
#+END_SRC

首先 EmployeeMapper 是个接口，其次它的每一个方法都和一个SQL，或者一个生成SQL的方法关联。这里用了嵌套类EmployeeMapper.Sql只是为了分离SQL和SQL对应的方法。

** 从方法到SQL <<SQLAnnotation>>
这里通过注解将方法和其对应的SQL关联起来，注解很多，这里列出常用的。

*注意* Mapper中方法不能重载

*** 通过 Select Insert Update Delete 注解绑定静态SQL
如 ~findAll delete~ 所示，这里要求SQL都是编译时常量。静态SQL简单，但是缺乏一定的灵活性。

*** 通过 SelectProvider InsertProvider UpdateProvider DeleteProvider 注解绑定动态SQL
如 ~insert update~ 所示，通过type指定产生SQL的类，通过method指定类的方法。

*** 通过 Options 注解可以指定额外的选项
这里~useGeneratedKeys~ 指出需要获取自增ID， ~keyProperty~ 指定自增ID对应的字段名

