blogs/mybatis-spring-howto.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mapper 的定义</h2>
<div class="outline-text-2" id="text-1">
<p>
Mapper是开发者关注最多的部分，先看看它是如何定义的。
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">interface</span> <span style="color: #00ff00;">EmployeeMapper</span> {
  <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Sql</span> {
    <span style="color: #00ffff; font-weight: bold;">final</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">TABLE</span> = <span style="color: #00ff00;">"employee"</span>;
    <span style="color: #00ffff; font-weight: bold;">final</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">SELECT</span> = <span style="color: #00ff00;">"SELECT * FROM "</span> + TABLE + <span style="color: #00ff00;">" WHERE id = #{id}"</span>;
    <span style="color: #00ffff; font-weight: bold;">final</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">SELECT_ALL</span> = <span style="color: #00ff00;">"SELECT * FROM "</span> + TABLE + <span style="color: #00ff00;">" ORDER BY id DESC LIMIT #{limit}"</span>;
    <span style="color: #00ffff; font-weight: bold;">final</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">SELECT_PAGE</span> = <span style="color: #00ff00;">"SELECT * FROM "</span> + TABLE +
      <span style="color: #00ff00;">" WHERE id &lt; #{id} ORDER BY id LIMIT #{limit}"</span>;
    <span style="color: #00ffff; font-weight: bold;">final</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">DELETE</span> = <span style="color: #00ff00;">"DELETE FROM "</span> + TABLE + <span style="color: #00ff00;">" WHERE id = #{id}"</span>;

    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #0000ff; font-weight: bold;">selectByName</span>(<span style="color: #00ff00;">Map</span>&lt;<span style="color: #00ff00;">String</span>, <span style="color: #00ff00;">Object</span>&gt; <span style="color: #ffff00;">param</span>) {
      <span style="color: #00ff00;">SQL</span> <span style="color: #ffff00;">sql</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SQL</span>().SELECT(<span style="color: #00ff00;">"*"</span>).FROM(TABLE)
        .WHERE(<span style="color: #00ff00;">"name = #{name}"</span>);

      <span style="color: #ff00ff;">Employee</span>.<span style="color: #00ff00;">Gender</span> <span style="color: #ffff00;">gender</span> = (<span style="color: #ff00ff;">Employee</span>.<span style="color: #00ff00;">Gender</span>) param.get(<span style="color: #00ff00;">"gender"</span>);
      <span style="color: #00ffff; font-weight: bold;">if</span> (gender != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.AND().WHERE(<span style="color: #00ff00;">"gender = #{gender}"</span>);
      }

      <span style="color: #00ffff; font-weight: bold;">return</span> sql.toString();
    }

    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #0000ff; font-weight: bold;">insert</span>(<span style="color: #00ff00;">Employee</span> <span style="color: #ffff00;">employee</span>) {
      <span style="color: #00ff00;">SQL</span> <span style="color: #ffff00;">sql</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SQL</span>()
        .INSERT_INTO(TABLE)
        .VALUES(<span style="color: #00ff00;">"name"</span>, <span style="color: #00ff00;">"#{name}"</span>)
        .VALUES(<span style="color: #00ff00;">"phone"</span>, <span style="color: #00ff00;">"#{phone}"</span>);
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getDepartment() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.VALUES(<span style="color: #00ff00;">"department"</span>, <span style="color: #00ff00;">"#{department}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getPosition() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.VALUES(<span style="color: #00ff00;">"position"</span>, <span style="color: #00ff00;">"#{position}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getGender() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.VALUES(<span style="color: #00ff00;">"gender"</span>, <span style="color: #00ff00;">"#{gender}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">return</span> sql.toString();
    }

    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ff00;">String</span> <span style="color: #0000ff; font-weight: bold;">update</span>(<span style="color: #00ff00;">Employee</span> <span style="color: #ffff00;">employee</span>) {
      <span style="color: #00ff00;">SQL</span> <span style="color: #ffff00;">sql</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SQL</span>().UPDATE(TABLE);
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getName() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.SET(<span style="color: #00ff00;">"name = #{name}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getDepartment() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.SET(<span style="color: #00ff00;">"department = #{department}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getPosition() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.SET(<span style="color: #00ff00;">"position = #{position}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getGender() != <span style="color: #ff00ff;">null</span>) {
        <span style="color: #ff00ff;">sql</span>.SET(<span style="color: #00ff00;">"gender = #{gender}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">if</span> (employee.getPhone() != <span style="color: #ff00ff;">Integer</span>.MIN_VALUE) {
        <span style="color: #ff00ff;">sql</span>.SET(<span style="color: #00ff00;">"phone = #{phone}"</span>);
      }
      <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #ff00ff;">sql</span>.WHERE(<span style="color: #00ff00;">"id = #{id}"</span>).toString();        
    }
  }

  <span style="color: #ff00ff;">@Select</span>(<span style="color: #ff00ff;">Sql</span>.<span style="color: #00ff00;">SELECT_ALL</span>)
  <span style="color: #00ff00;">List</span>&lt;<span style="color: #00ff00;">Employee</span>&gt; <span style="color: #0000ff; font-weight: bold;">findAll</span>(<span style="color: #00ff00;">long</span> <span style="color: #ffff00;">limit</span>);

  <span style="color: #ff00ff;">@Select</span>(<span style="color: #ff00ff;">Sql</span>.<span style="color: #00ff00;">SELECT_PAGE</span>)
  <span style="color: #00ff00;">List</span>&lt;<span style="color: #00ff00;">Employee</span>&gt; <span style="color: #0000ff; font-weight: bold;">findPager</span>(<span style="color: #ff00ff;">@Param</span>(<span style="color: #00ff00;">"id"</span>) <span style="color: #00ff00;">long</span> <span style="color: #ffff00;">id</span>, <span style="color: #ff00ff;">@Param</span>(<span style="color: #00ff00;">"limit"</span>) <span style="color: #00ff00;">long</span> <span style="color: #ffff00;">limit</span>);

  <span style="color: #ff00ff;">@SelectProvider</span>(type = Sql.<span style="color: #00ffff; font-weight: bold;">class</span>, method = <span style="color: #00ff00;">"selectByName"</span>)
  <span style="color: #00ff00;">List</span>&lt;<span style="color: #00ff00;">Map</span>&lt;<span style="color: #00ff00;">String</span>, <span style="color: #00ff00;">Object</span>&gt;&gt; <span style="color: #0000ff; font-weight: bold;">findByName</span>(<span style="color: #ff00ff;">@Param</span>(<span style="color: #00ff00;">"name"</span>) <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">name</span>,
                                       <span style="color: #ff00ff;">@Param</span>(<span style="color: #00ff00;">"gender"</span>) <span style="color: #ff00ff;">Employee</span>.<span style="color: #00ff00;">Gender</span> <span style="color: #ffff00;">gender</span>);

  <span style="color: #ff00ff;">@Select</span>(<span style="color: #ff00ff;">Sql</span>.<span style="color: #00ff00;">SELECT</span>)
  <span style="color: #00ff00;">Employee</span> <span style="color: #0000ff; font-weight: bold;">find</span>(<span style="color: #ff00ff;">@Param</span>(<span style="color: #00ff00;">"id"</span>) <span style="color: #00ff00;">long</span> <span style="color: #ffff00;">id</span>);

  <span style="color: #ff00ff;">@InsertProvider</span>(type = Sql.<span style="color: #00ffff; font-weight: bold;">class</span>, method = <span style="color: #00ff00;">"insert"</span>)
  <span style="color: #ff00ff;">@Options</span>(useGeneratedKeys=<span style="color: #ff00ff;">true</span>, keyProperty = <span style="color: #00ff00;">"id"</span>)
  <span style="color: #00ff00;">int</span> <span style="color: #0000ff; font-weight: bold;">add</span>(<span style="color: #00ff00;">Employee</span> <span style="color: #ffff00;">employee</span>);

  <span style="color: #ff00ff;">@UpdateProvider</span>(type = Sql.<span style="color: #00ffff; font-weight: bold;">class</span>, method = <span style="color: #00ff00;">"update"</span>)
  <span style="color: #00ff00;">int</span> <span style="color: #0000ff; font-weight: bold;">update</span>(<span style="color: #00ff00;">Employee</span> <span style="color: #ffff00;">employee</span>);

  <span style="color: #ff00ff;">@Delete</span>(<span style="color: #ff00ff;">Sql</span>.<span style="color: #00ff00;">DELETE</span>)
  <span style="color: #00ff00;">int</span> <span style="color: #0000ff; font-weight: bold;">delete</span>(<span style="color: #00ff00;">long</span> <span style="color: #ffff00;">id</span>);
}
</pre>
</div>

<p>
首先 EmployeeMapper 是个接口，其次它的每一个方法都和一个SQL，或者一个生成SQL的方法关联。这里用了嵌套类EmployeeMapper.Sql只是为了分离SQL和SQL对应的方法。
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 从方法到SQL <a id="SQLAnnotation" name="SQLAnnotation"></a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
这里通过注解将方法和其对应的SQL关联起来，注解很多，这里列出常用的。
</p>

<p>
<b>注意</b> Mapper中方法不能重载
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 通过 Select Insert Update Delete 注解绑定静态SQL</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
如 <code>findAll delete</code> 所示，这里要求SQL都是编译时常量。静态SQL简单，但是缺乏一定的灵活性。
</p>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 通过 SelectProvider InsertProvider UpdateProvider DeleteProvider 注解绑定动态SQL</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
如 <code>insert update</code> 所示，通过type指定产生SQL的类，通过method指定类的方法。
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 通过 Options 注解可以指定额外的选项</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
这里<code>useGeneratedKeys</code> 指出需要获取自增ID， <code>keyProperty</code> 指定自增ID对应的字段名
</p>
</div>
</div>
</div>
