blogsrc/mybatis-spring-howto.org
** 从方法的参数到SQL的参数
Mapper中SQL的参数如何表示呢？ 使用这样的形式 ~#{name}~ ，表示此处是一个参数，它的名字是 ~name~ 。显然我们需要把传递给方法的参数，和SQL中的参数绑定起来。当查询返回时，还需要把查询结果和方法的返回值绑定。绑定关系一旦确定，还需要 ~JavaType~ 和 ~Java.sql.Types~ 的类型转换，使用所谓的 [[TypeHandler][TypeHandler]] ，这个后面单独说。

*注意* 方法的参数不能为null，如果可能为null，需要用动态SQL判断一下。

*** 单个简单参数
参数类型是long，String，并且只有一个。此时SQL需要绑定变量时，只能绑定它。

*** 多个简单参数
此时需要通过 ~Param~ 注解来标记变量对应的SQL变量的名字。例如 ~findByName(@Param("name") String name, @Param("gender") Employee.Gender gender)~ 指定了 *name* 绑定到 *#{name}* *gender* 绑定到 *#{gender}* 。

*注意* 动态生成的SQL的函数，只接受一个参数。EmployeeMapper.Sql 中的所有函数都只有一个参数，这里有个小转换。例如：EmployeeMapper.findByName 有两个参数，但是它的动态SQL函数 EmployeeMapper.Sql.selectByName 却只接受一个函数，此时MyBatis会把 EmployeeMapper.findByName 的两个参数转成一个Map，Map的key是Param注解的值。

*** 对象参数
如果SQL需要 *#{name}* 对应的值时，会调用对象的 *getName* 方法。如果有 *public* 的 *name* 字段也可以。

*** Map参数
如果SQL需要 *#{name}* 时，调用Map的 *get(Object key)* 方法。

*** 查询返回值
如果查询返回一行，那么返回值可以是一个Map或者一个对象。返回的数据行绑定到Map，行的列对应Map的Key，数据类型是String，列值对应Map的Value，数据类型由默认的TypeHandler决定。返回的数据绑定到对象，和对象参数的绑定方法一样。

如何返回多行，返回值是一个Map或者对象的List。

如果增删改SQL，那么返回值是int，返回影响的行数。

*注意* 返回Map和返回对象有一点不同。返回对象时，知道 ~JavaType~ 和 ~java.sql.Types~ ，所以TypeHandler的作用更大，但是返回Map时，没有预定义的 ~JavaType~ 。例如：对象写入数据库时，假设把enum转成了int，那么从数据库读数据时，如果返回Map，读到int，并不知道需要转成enum。

** 区分三类数据值
- *null* 值， *null* 是没有值的意思，值没有设置。基本类型int，long没有null，推荐使用=MIN_VALUE=当null。
- 默认值，当值为 *null* 时采用的值，可以没有。
- 设置的值。

区分这三个值的意义在于，如果是读操作，如果有默认值的话，那么可以给 *null* 值一个默认值。如果是写操作，那么 *null* 值意味着不要更改数据库的值。

** 动态SQL
动态SQL的构建函数（method）只是构建SQL，值绑定并不是发生在这个阶段。但是在这个阶段显式绑定也没有太大问题。例如 ~sql.SET("name = #{name}")~ 写成 ~sql.SET("name = " + employee.getName())~ 也没有什么不可以，除了可能引发SQL注入。

** SQL注入
客户端请求SQL服务器执行SQL有两种方式。一种是请求最终的SQL，例如 ~SELECT * FROM employee WHERE id = 10~ 。一种是先请求 ~SELECT * FROM employee WHERE id = #{id}~ ，然后发送 id 对应的具体值过去，这被称作 *Prepare Execute* 两个阶段。

前者更直观，也是SQL注入的地方。因为10是用户输入的，如果缺少过滤，用户可能输入 *10; drop table employee* ，这样最终的SQL语句是 ~SELECT * FROM employee WHERE id = 10; drop table employee~ ， *drop* 语句被注入了。

后者没有这个问题，后者执行 id 为 *10; drop table employee* 的查询。虽然可以防止SQL注入，但是并不能预防持久型XSS攻击，适当的输入过滤有时还是必要的。

* SqlSessionFactory
Mapper定义了函数到SQL的映射，可是怎么用呢？首先Mapper是个 *接口* ，其次它没有关联任何的数据库。SqlSessionFactory完成了Mapper的 *实现* ，并且关联了数据库。

<<GetMapperManual>>
#+BEGIN_SRC java
SqlSessionFactoryBean sqlSessionFactoryBean = new SqlSessionFactoryBean();
sqlSessionFactoryBean.setDataSource(dataSource);
    
SqlSessionFactory sqlSessionFactory = (SqlSessionFactory) sqlSessionFactoryBean.getObject();
sqlSessionFactory.getConfiguration().addMapper(EmployeeMapper.class);
sqlSessionFactory.getConfiguration().getTypeHandlerRegistry().register(
  Employee.Gender.class, new EnumValueTypeHandler<Employee.Gender>(Employee.Gender.class));

SqlSessionTemplate sqlSession = new SqlSessionTemplate(sqlSessionFactory);
EmployeeMapper employeeMapper = sqlSession.getMapper(EmployeeMapper.class);
Employee employee = employeeMapper.find(id);
#+END_SRC

上面代码分两部分，一是SqlSessionFactory的构造，一是得到Mapper接口的实例。

** 构造 SqlSessionFactory
构造SqlSessionFactory主要分两部分，一个是配置DataBase，一个是配置要注册的Mapper。配置DataBase是个很常规的操作，自动生成Mapper实例就有点神奇了。

MyBatis利用 [[https://github.com/cglib/cglib][CGLIB]] 自动生成Mapper的实现，这并不是特别难的事情，因为操作数据的代码，除了SQL和对象绑定，代码基本是相同的，而SQL和对象绑定已经在Mapper中说明了。

** 和Spring的融合
事情到这里按理该结束了，但是这个不符合spring的风格，EmployeeMapper不是应该自动注入的吗？是的，在Spring中使用MyBatis非常简单。只需要配置 SqlSessionFactory，和需要注册的Mapper就可以了。

Spring 自动绑定
#+BEGIN_SRC java
@Autowired EmployeeMapper employeeMapper;
#+END_SRC

配置SqlSessionFactory
#+BEGIN_SRC java
@Bean
public SqlSessionFactory sqlSessionFactory() throws Exception {
  SqlSessionFactoryBean sqlSessionFactoryBean = new SqlSessionFactoryBean();
  sqlSessionFactoryBean.setDataSource(dataSource);
    
  SqlSessionFactory sqlSessionFactory = (SqlSessionFactory) sqlSessionFactoryBean.getObject();
  sqlSessionFactory.getConfiguration().getTypeHandlerRegistry().register(
    Employee.Gender.class, new EnumValueTypeHandler<Employee.Gender>(Employee.Gender.class));
  return sqlSessionFactory;
}

#+END_SRC

这里没有注册Mapper，因为Mapper可能很多，如果一个个手工注册，维护起来比较麻烦，有两个方法可以用于自动扫描需要注册的Mapper。

*** 使用 MapperScan 发现Mapper
#+BEGIN_SRC java
@Configuration
@MapperScan("example.mapper")
#+END_SRC

所有在package example.mapper下Mapper都会被自动注册到sqlSessionFactory。

*** 使用 MapperScannerConfigurer <<MapperScannerConfigurer>>
#+BEGIN_SRC java
@Bean
public MapperScannerConfigurer mapperScannerConfigurer() {
  MapperScannerConfigurer configurer = new MapperScannerConfigurer();
  configurer.setBasePackage("example.mapper");
  configurer.setSqlSessionFactoryBeanName(sqlSessionFactory());
  return configurer;
}
#+END_SRC

这里配置了SqlSessionFactory和需要扫描的Mapper的BasePackage。

自此，和Spring的融合就完成了。借助Spring的机制，很多操作自动化了，例如，生成EmployeeMapper的Bean。具体可以研究 ~MapperScannerConfigurer.java~ 看这个过程是怎样的。

前面说过，注入依赖于约定，那么假设不止一个数据库呢？多个数据库用同一个Mapper呢？听起来还挺复杂的。

