blogs/mybatis-spring-howto.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 从方法的参数到SQL的参数</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Mapper中SQL的参数如何表示呢？ 使用这样的形式 <code>#{name}</code> ，表示此处是一个参数，它的名字是 <code>name</code> 。显然我们需要把传递给方法的参数，和SQL中的参数绑定起来。当查询返回时，还需要把查询结果和方法的返回值绑定。绑定关系一旦确定，还需要 <code>JavaType</code> 和 <code>Java.sql.Types</code> 的类型转换，使用所谓的 <a href="#TypeHandler">TypeHandler</a> ，这个后面单独说。
</p>

<p>
<b>注意</b> 方法的参数不能为null，如果可能为null，需要用动态SQL判断一下。
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 单个简单参数</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
参数类型是long，String，并且只有一个。此时SQL需要绑定变量时，只能绑定它。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 多个简单参数</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
此时需要通过 <code>Param</code> 注解来标记变量对应的SQL变量的名字。例如 <code>findByName(@Param("name") String name, @Param("gender") Employee.Gender gender)</code> 指定了 <b>name</b> 绑定到 <b>#{name}</b> <b>gender</b> 绑定到 <b>#{gender}</b> 。
</p>

<p>
<b>注意</b> 动态生成的SQL的函数，只接受一个参数。EmployeeMapper.Sql 中的所有函数都只有一个参数，这里有个小转换。例如：EmployeeMapper.findByName 有两个参数，但是它的动态SQL函数 EmployeeMapper.Sql.selectByName 却只接受一个函数，此时MyBatis会把 EmployeeMapper.findByName 的两个参数转成一个Map，Map的key是Param注解的值。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 对象参数</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
如果SQL需要 <b>#{name}</b> 对应的值时，会调用对象的 <b>getName</b> 方法。如果有 <b>public</b> 的 <b>name</b> 字段也可以。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Map参数</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
如果SQL需要 <b>#{name}</b> 时，调用Map的 <b>get(Object key)</b> 方法。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> 查询返回值</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
如果查询返回一行，那么返回值可以是一个Map或者一个对象。返回的数据行绑定到Map，行的列对应Map的Key，数据类型是String，列值对应Map的Value，数据类型由默认的TypeHandler决定。返回的数据绑定到对象，和对象参数的绑定方法一样。
</p>

<p>
如何返回多行，返回值是一个Map或者对象的List。
</p>

<p>
如果增删改SQL，那么返回值是int，返回影响的行数。
</p>

<p>
<b>注意</b> 返回Map和返回对象有一点不同。返回对象时，知道 <code>JavaType</code> 和 <code>java.sql.Types</code> ，所以TypeHandler的作用更大，但是返回Map时，没有预定义的 <code>JavaType</code> 。例如：对象写入数据库时，假设把enum转成了int，那么从数据库读数据时，如果返回Map，读到int，并不知道需要转成enum。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 区分三类数据值</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><b>null</b> 值， <b>null</b> 是没有值的意思，值没有设置。基本类型int，long没有null，推荐使用<code>MIN_VALUE</code>当null。
</li>
<li>默认值，当值为 <b>null</b> 时采用的值，可以没有。
</li>
<li>设置的值。
</li>
</ul>

<p>
区分这三个值的意义在于，如果是读操作，如果有默认值的话，那么可以给 <b>null</b> 值一个默认值。如果是写操作，那么 <b>null</b> 值意味着不要更改数据库的值。
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 动态SQL</h3>
<div class="outline-text-3" id="text-1-4">
<p>
动态SQL的构建函数（method）只是构建SQL，值绑定并不是发生在这个阶段。但是在这个阶段显式绑定也没有太大问题。例如 <code>sql.SET("name = #{name}")</code> 写成 <code>sql.SET("name = " + employee.getName())</code> 也没有什么不可以，除了可能引发SQL注入。
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> SQL注入</h3>
<div class="outline-text-3" id="text-1-5">
<p>
客户端请求SQL服务器执行SQL有两种方式。一种是请求最终的SQL，例如 <code>SELECT * FROM employee WHERE id = 10</code> 。一种是先请求 <code>SELECT * FROM employee WHERE id = #{id}</code> ，然后发送 id 对应的具体值过去，这被称作 <b>Prepare Execute</b> 两个阶段。
</p>

<p>
前者更直观，也是SQL注入的地方。因为10是用户输入的，如果缺少过滤，用户可能输入 <b>10; drop table employee</b> ，这样最终的SQL语句是 <code>SELECT * FROM employee WHERE id = 10; drop table employee</code> ， <b>drop</b> 语句被注入了。
</p>

<p>
后者没有这个问题，后者执行 id 为 <b>10; drop table employee</b> 的查询。虽然可以防止SQL注入，但是并不能预防持久型XSS攻击，适当的输入过滤有时还是必要的。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> SqlSessionFactory</h2>
<div class="outline-text-2" id="text-2">
<p>
Mapper定义了函数到SQL的映射，可是怎么用呢？首先Mapper是个 <b>接口</b> ，其次它没有关联任何的数据库。SqlSessionFactory完成了Mapper的 <b>实现</b> ，并且关联了数据库。
</p>

<p>
<a id="GetMapperManual" name="GetMapperManual"></a>
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ff00;">SqlSessionFactoryBean</span> <span style="color: #ffff00;">sqlSessionFactoryBean</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SqlSessionFactoryBean</span>();
sqlSessionFactoryBean.setDataSource(dataSource);

<span style="color: #00ff00;">SqlSessionFactory</span> <span style="color: #ffff00;">sqlSessionFactory</span> = (<span style="color: #00ff00;">SqlSessionFactory</span>) sqlSessionFactoryBean.getObject();
sqlSessionFactory.getConfiguration().addMapper(EmployeeMapper.<span style="color: #00ffff; font-weight: bold;">class</span>);
sqlSessionFactory.getConfiguration().getTypeHandlerRegistry().register(
  <span style="color: #ff00ff;">Employee</span>.Gender.<span style="color: #00ffff; font-weight: bold;">class</span>, <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">EnumValueTypeHandler</span>&lt;<span style="color: #ff00ff;">Employee</span>.<span style="color: #00ff00;">Gender</span>&gt;(<span style="color: #ff00ff;">Employee</span>.Gender.<span style="color: #00ffff; font-weight: bold;">class</span>));

<span style="color: #00ff00;">SqlSessionTemplate</span> <span style="color: #ffff00;">sqlSession</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SqlSessionTemplate</span>(sqlSessionFactory);
<span style="color: #00ff00;">EmployeeMapper</span> <span style="color: #ffff00;">employeeMapper</span> = sqlSession.getMapper(EmployeeMapper.<span style="color: #00ffff; font-weight: bold;">class</span>);
<span style="color: #00ff00;">Employee</span> <span style="color: #ffff00;">employee</span> = employeeMapper.find(id);
</pre>
</div>

<p>
上面代码分两部分，一是SqlSessionFactory的构造，一是得到Mapper接口的实例。
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 构造 SqlSessionFactory</h3>
<div class="outline-text-3" id="text-2-1">
<p>
构造SqlSessionFactory主要分两部分，一个是配置DataBase，一个是配置要注册的Mapper。配置DataBase是个很常规的操作，自动生成Mapper实例就有点神奇了。
</p>

<p>
MyBatis利用 <a href="https://github.com/cglib/cglib">CGLIB</a> 自动生成Mapper的实现，这并不是特别难的事情，因为操作数据的代码，除了SQL和对象绑定，代码基本是相同的，而SQL和对象绑定已经在Mapper中说明了。
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 和Spring的融合</h3>
<div class="outline-text-3" id="text-2-2">
<p>
事情到这里按理该结束了，但是这个不符合spring的风格，EmployeeMapper不是应该自动注入的吗？是的，在Spring中使用MyBatis非常简单。只需要配置 SqlSessionFactory，和需要注册的Mapper就可以了。
</p>

<p>
Spring 自动绑定
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Autowired</span> <span style="color: #00ff00;">EmployeeMapper</span> <span style="color: #ffff00;">employeeMapper</span>;
</pre>
</div>

<p>
配置SqlSessionFactory
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Bean</span>
<span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">SqlSessionFactory</span> <span style="color: #0000ff; font-weight: bold;">sqlSessionFactory</span>() <span style="color: #00ffff; font-weight: bold;">throws</span> <span style="color: #00ff00;">Exception</span> {
  <span style="color: #00ff00;">SqlSessionFactoryBean</span> <span style="color: #ffff00;">sqlSessionFactoryBean</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SqlSessionFactoryBean</span>();
  sqlSessionFactoryBean.setDataSource(dataSource);

  <span style="color: #00ff00;">SqlSessionFactory</span> <span style="color: #ffff00;">sqlSessionFactory</span> = (<span style="color: #00ff00;">SqlSessionFactory</span>) sqlSessionFactoryBean.getObject();
  sqlSessionFactory.getConfiguration().getTypeHandlerRegistry().register(
    <span style="color: #ff00ff;">Employee</span>.Gender.<span style="color: #00ffff; font-weight: bold;">class</span>, <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">EnumValueTypeHandler</span>&lt;<span style="color: #ff00ff;">Employee</span>.<span style="color: #00ff00;">Gender</span>&gt;(<span style="color: #ff00ff;">Employee</span>.Gender.<span style="color: #00ffff; font-weight: bold;">class</span>));
  <span style="color: #00ffff; font-weight: bold;">return</span> sqlSessionFactory;
}
</pre>
</div>

<p>
这里没有注册Mapper，因为Mapper可能很多，如果一个个手工注册，维护起来比较麻烦，有两个方法可以用于自动扫描需要注册的Mapper。
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 使用 MapperScan 发现Mapper</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Configuration</span>
<span style="color: #ff00ff;">@MapperScan</span>(<span style="color: #00ff00;">"example.mapper"</span>)
</pre>
</div>

<p>
所有在package example.mapper下Mapper都会被自动注册到sqlSessionFactory。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 使用 MapperScannerConfigurer <a id="MapperScannerConfigurer" name="MapperScannerConfigurer"></a></h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Bean</span>
<span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">MapperScannerConfigurer</span> <span style="color: #0000ff; font-weight: bold;">mapperScannerConfigurer</span>() {
  <span style="color: #00ff00;">MapperScannerConfigurer</span> <span style="color: #ffff00;">configurer</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">MapperScannerConfigurer</span>();
  configurer.setBasePackage(<span style="color: #00ff00;">"example.mapper"</span>);
  configurer.setSqlSessionFactoryBeanName(sqlSessionFactory());
  <span style="color: #00ffff; font-weight: bold;">return</span> configurer;
}
</pre>
</div>

<p>
这里配置了SqlSessionFactory和需要扫描的Mapper的BasePackage。
</p>

<p>
自此，和Spring的融合就完成了。借助Spring的机制，很多操作自动化了，例如，生成EmployeeMapper的Bean。具体可以研究 <code>MapperScannerConfigurer.java</code> 看这个过程是怎样的。
</p>

<p>
前面说过，注入依赖于约定，那么假设不止一个数据库呢？多个数据库用同一个Mapper呢？听起来还挺复杂的。
</p>
</div>
</div>
</div>
</div>
