blogsrc/mybatis-spring-howto.org
* 应对多个数据库 (1) <<MultiDbOne>>
一个应用同时使用多个数据库是很常见的事情，同时，为了应对不断增长的数据，分库分表是常见的策略。分表很简单，利用动态SQL，动态生成表名就可以了，毕竟还是在同一个数据库下面。分库怎么办？

通常说的分库，是把同一张表按照某个KEY分到多个数据库中，首先是多个库，其次是表的schema一样，也即Mapper一样。而单纯的多库，表的schema是不同的。

有必要先提一句，如果不是为了利用Spring的自动绑定，每次手动获取Mapper，就像 [[GetMapperManual][上面]] 所做的那样，使用MyBatis毫无压力，所以当我们面临复杂的架构时，总是可以手动实现Bean，然后自动绑定。

** 多个库，Mapper不相同
这个其实并不难，在 [[MapperScannerConfigurer][使用 MapperScannerConfigurer]] 部分事实上已经演示过了，定义多个 ~SqlSessionFactory~ ，每个对应不同的DataSource，再定义多个 ~MapScannerConfigurer~ ，每个使用不同的 ~SqlSessionFactory~ 和
不同的BasePackage扫描不同的Mapper。

** 多个库，Mapper相同
似乎和上个问题一样，但是Mapper影响巨大，考虑到Spring自动绑定的重要依据是数据类型，Mapper相同意味着数据类型是相同的。这里的需求不是自动绑定一个Mapper，而是自动绑定Mapper的一个数组，每个Mapper对应一个数据库。

生成多个SqlSessionFactory并无难事，我们手动实现一个Bean ~ArrayList<EmployeeMapper>~ 。
#+BEGIN_SRC java
@Bean(name = "dbHorizontalPartition")
public ArrayList<EmployeeMapper> dbHorizontalPartition() throws Exception {
  ArrayList<SqlSessionFactory> sqlSessionFactoryList = dbHorizontalPartitionSqlSessionFactory();
  ArrayList<EmployeeMapper> employeeMapperList = new ArrayList<>();

  for (SqlSessionFactory sqlSessionFactory : sqlSessionFactoryList) {
    SqlSessionTemplate sqlSessionTemplate = new SqlSessionTemplate(sqlSessionFactory);
    employeeMapperList.add(sqlSessionTemplate.getMapper(EmployeeMapper.class));
  }
    
  return employeeMapperList;
}
#+END_SRC

自动绑定，根据分区函数，选择合适的EmployeeMapper，也即选择合适的数据库。
#+BEGIN_SRC java
@Autowired @Qualifier("dbHorizontalPartition")
ArrayList<EmployeeMapper> employeeMapperList;
#+END_SRC

* 应对多个数据库 (2) <<MultiDbTwo>>
在 [[MultiDbOne][(1)]] 中，核心是一个Mapper一个DataSource，如果需要一个Mapper多个DataSource，就手动生成Mapper的多个实例和DataSource对应，一方面用起来不是很方便，另一方面暴露了逻辑上只有一个DataSource的细节。

另一种思路是，使用一个 *逻辑上* 的DataSource封装（并代理）所有 *物理上* 的DataSource，然后根据某些准则选择特定的DataSource，从而实现一个Mapper动态的使用不同的DataSource。可以继承Spring的 [[https://docs.spring.io/spring/docs/current/javadoc-api/org/springframework/jdbc/datasource/lookup/AbstractRoutingDataSource.html][AbstractRoutingDataSource]] ，（所有 *物理上* DataSource都有一个名字）并实现 ~determineCurrentLookupKey()~ 返回本次所需的DataSource的名字。

可以采用包含了 *ThreadLocal* 成员的单例（其实就是个每线程全局变量），假设名为 CustomerContextHolder，在调用Mapper前设置需要的DataSource的一些信息，在 ~determineCurrentLookupKey~ 中获取这些信息，并根据这些信息选择合适的DataSource的名字。参考 [[https://spring.io/blog/2007/01/23/dynamic-datasource-routing/][Dynamic DataSource Routing]] 。作为一种简化，可以使用AOP，在Mapper函数调用前，通过获取函数的注解，或者获取函数参数的注解来设置DataSource。如下是两个用例：

** 自动主从分离
在Mapper函数调用前，通过获取 [[SQLAnnotation][注解]]，例如@Select，来判断当前操作是 *读* 还是 *写* ，设置CustomerContextHolder的值为 *slave* 或 *master* ，如果有多个slave，可以在 determineCurrentLookupKey 中随机选择一个。

** 自动分多个库
在Mapper编写过程中，通过引入 @PartitionKey 注解，例如 find(@PartitionKey long id) 或者 add(@PartitionKey("id") Entity entity)，在Mapper函数调用前，获取id的值，并设置到 CustomerContextHolder 中，determineCurrentLookupKey 则根据id的值返回相应分区的DataSource的名字。

** 总结
当一个Mapper对应多个DataSource的情况下，用这种方法更简单。可以隐藏分区的细节。当不同Mapper对应不同DataSource的情况下，配置多个 [[MapperScannerConfigurer][MapperScannerConfigurer]] 似乎更简单。这部分的实例代码，可以从 ~SmartDataSource~ 中找到。

* TypeHandler <<TypeHandler>>
MyBatis 自身定义了很多的 [[http://www.mybatis.org/mybatis-3/configuration.html#typeHandlers][TypeHandlers]] ，它的本质还是定义~JavaType~ 如何转成 ~SqlType~ 。这个并没有什么难的，可以参考 [[https://github.com/zzyongx/c-gist/tree/master/java/howto][spring-howto]] 中的样例代码， ~LocalDateTimeTypeHandler~ 和 ~EnumValueTypeHandler~ 。

这里特别说一下Enum类型，默认是 ~EnumTypeHandler~ ，转成enum转成字符串存入数据库。为了优化考虑，可能会想要把enum转成数字存入数据库，这时会选择 ~EnumOrdinalTypeHandler~ ，但这是一个陷阱。因为Enum自身的原因，在增删了Enum元素之后，对应的ordinal是会变的。可以考虑样例代码中的 ~EnumValueTypeHandler~ ，它可以给每个Enum元素绑定一个数字值。

* 缓存
Mybatis 可以配置二级缓存，但是我认为基本是鸡肋。缓存主要面临两个问题，而这两个问题，Mybatis都没有很好的解决。

- 缓存的KEY是什么，也即如何选择缓存粒度？
- 何时清理缓存，也即如何保持数据一致性？

一条查询SQL执行成功，如果需要缓存结果，那么选择什么当KEY呢？直观的选择是拿SQL语句当KEY，可是数据变更时，如何清理缓存呢？变更数据的SQL显然不知道有哪些相关的查询SQL需要被清理，所以只能清理掉所有缓存（这正是MySQL自身的查询缓存策略，而在实践中是推荐关掉MySQL的查询缓存的），或者不清理任何缓存，让数据过期，容忍短暂的数据不一致。

Mybatis 正是用查询SQL当缓存的KEY，当有变更数据的SQL发生时，清理掉所有缓存。在高并发的情况下，这种缓存策略对性能提升有限，而并发不高时，用缓存根本没有意义。

有缓存需求时，可以考虑在DAO之上封装一层，可以采用数据库行的PRIMARY KEY作为缓存，粒度较细。并且更新总是可以根据PRIMARY KEY更新。缓存总是带来复杂度的提升，优先考虑优化查询和数据库，缓存带来的好处非常显然时，再考虑使用缓存，并且要谨慎选择缓存的KEY。
