blogs/mybatis-spring-howto.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 应对多个数据库 (1) <a id="MultiDbOne" name="MultiDbOne"></a></h2>
<div class="outline-text-2" id="text-3">
<p>
一个应用同时使用多个数据库是很常见的事情，同时，为了应对不断增长的数据，分库分表是常见的策略。分表很简单，利用动态SQL，动态生成表名就可以了，毕竟还是在同一个数据库下面。分库怎么办？
</p>

<p>
通常说的分库，是把同一张表按照某个KEY分到多个数据库中，首先是多个库，其次是表的schema一样，也即Mapper一样。而单纯的多库，表的schema是不同的。
</p>

<p>
有必要先提一句，如果不是为了利用Spring的自动绑定，每次手动获取Mapper，就像 <a href="#GetMapperManual">上面</a> 所做的那样，使用MyBatis毫无压力，所以当我们面临复杂的架构时，总是可以手动实现Bean，然后自动绑定。
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 多个库，Mapper不相同</h3>
<div class="outline-text-3" id="text-3-1">
<p>
这个其实并不难，在 <a href="#MapperScannerConfigurer">使用 MapperScannerConfigurer</a> 部分事实上已经演示过了，定义多个 <code>SqlSessionFactory</code> ，每个对应不同的DataSource，再定义多个 <code>MapScannerConfigurer</code> ，每个使用不同的 <code>SqlSessionFactory</code> 和
不同的BasePackage扫描不同的Mapper。
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 多个库，Mapper相同</h3>
<div class="outline-text-3" id="text-3-2">
<p>
似乎和上个问题一样，但是Mapper影响巨大，考虑到Spring自动绑定的重要依据是数据类型，Mapper相同意味着数据类型是相同的。这里的需求不是自动绑定一个Mapper，而是自动绑定Mapper的一个数组，每个Mapper对应一个数据库。
</p>

<p>
生成多个SqlSessionFactory并无难事，我们手动实现一个Bean <code>ArrayList&lt;EmployeeMapper&gt;</code> 。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Bean</span>(name = <span style="color: #00ff00;">"dbHorizontalPartition"</span>)
<span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">ArrayList</span>&lt;<span style="color: #00ff00;">EmployeeMapper</span>&gt; <span style="color: #0000ff; font-weight: bold;">dbHorizontalPartition</span>() <span style="color: #00ffff; font-weight: bold;">throws</span> <span style="color: #00ff00;">Exception</span> {
  <span style="color: #00ff00;">ArrayList</span>&lt;<span style="color: #00ff00;">SqlSessionFactory</span>&gt; <span style="color: #ffff00;">sqlSessionFactoryList</span> = dbHorizontalPartitionSqlSessionFactory();
  <span style="color: #00ff00;">ArrayList</span>&lt;<span style="color: #00ff00;">EmployeeMapper</span>&gt; <span style="color: #ffff00;">employeeMapperList</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">ArrayList</span>&lt;&gt;();

  <span style="color: #00ffff; font-weight: bold;">for</span> (<span style="color: #00ff00;">SqlSessionFactory</span> <span style="color: #ffff00;">sqlSessionFactory</span> : sqlSessionFactoryList) {
    <span style="color: #00ff00;">SqlSessionTemplate</span> <span style="color: #ffff00;">sqlSessionTemplate</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">SqlSessionTemplate</span>(sqlSessionFactory);
    employeeMapperList.add(sqlSessionTemplate.getMapper(EmployeeMapper.<span style="color: #00ffff; font-weight: bold;">class</span>));
  }

  <span style="color: #00ffff; font-weight: bold;">return</span> employeeMapperList;
}
</pre>
</div>

<p>
自动绑定，根据分区函数，选择合适的EmployeeMapper，也即选择合适的数据库。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Autowired</span> <span style="color: #ff00ff;">@Qualifier</span>(<span style="color: #00ff00;">"dbHorizontalPartition"</span>)
<span style="color: #00ff00;">ArrayList</span>&lt;<span style="color: #00ff00;">EmployeeMapper</span>&gt; <span style="color: #ffff00;">employeeMapperList</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 应对多个数据库 (2) <a id="MultiDbTwo" name="MultiDbTwo"></a></h2>
<div class="outline-text-2" id="text-4">
<p>
在 <a href="#MultiDbOne">(1)</a> 中，核心是一个Mapper一个DataSource，如果需要一个Mapper多个DataSource，就手动生成Mapper的多个实例和DataSource对应，一方面用起来不是很方便，另一方面暴露了逻辑上只有一个DataSource的细节。
</p>

<p>
另一种思路是，使用一个 <b>逻辑上</b> 的DataSource封装（并代理）所有 <b>物理上</b> 的DataSource，然后根据某些准则选择特定的DataSource，从而实现一个Mapper动态的使用不同的DataSource。可以继承Spring的 <a href="https://docs.spring.io/spring/docs/current/javadoc-api/org/springframework/jdbc/datasource/lookup/AbstractRoutingDataSource.html">AbstractRoutingDataSource</a> ，（所有 <b>物理上</b> DataSource都有一个名字）并实现 <code>determineCurrentLookupKey()</code> 返回本次所需的DataSource的名字。
</p>

<p>
可以采用包含了 <b>ThreadLocal</b> 成员的单例（其实就是个每线程全局变量），假设名为 CustomerContextHolder，在调用Mapper前设置需要的DataSource的一些信息，在 <code>determineCurrentLookupKey</code> 中获取这些信息，并根据这些信息选择合适的DataSource的名字。参考 <a href="https://spring.io/blog/2007/01/23/dynamic-datasource-routing/">Dynamic DataSource Routing</a> 。作为一种简化，可以使用AOP，在Mapper函数调用前，通过获取函数的注解，或者获取函数参数的注解来设置DataSource。如下是两个用例：
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 自动主从分离</h3>
<div class="outline-text-3" id="text-4-1">
<p>
在Mapper函数调用前，通过获取 <a href="#SQLAnnotation">注解</a>，例如@Select，来判断当前操作是 <b>读</b> 还是 <b>写</b> ，设置CustomerContextHolder的值为 <b>slave</b> 或 <b>master</b> ，如果有多个slave，可以在 determineCurrentLookupKey 中随机选择一个。
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 自动分多个库</h3>
<div class="outline-text-3" id="text-4-2">
<p>
在Mapper编写过程中，通过引入 @PartitionKey 注解，例如 find(@PartitionKey long id) 或者 add(@PartitionKey("id") Entity entity)，在Mapper函数调用前，获取id的值，并设置到 CustomerContextHolder 中，determineCurrentLookupKey 则根据id的值返回相应分区的DataSource的名字。
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 总结</h3>
<div class="outline-text-3" id="text-4-3">
<p>
当一个Mapper对应多个DataSource的情况下，用这种方法更简单。可以隐藏分区的细节。当不同Mapper对应不同DataSource的情况下，配置多个 <a href="#MapperScannerConfigurer">MapperScannerConfigurer</a> 似乎更简单。这部分的实例代码，可以从 <code>SmartDataSource</code> 中找到。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> TypeHandler <a id="TypeHandler" name="TypeHandler"></a></h2>
<div class="outline-text-2" id="text-5">
<p>
MyBatis 自身定义了很多的 <a href="http://www.mybatis.org/mybatis-3/configuration.html#typeHandlers">TypeHandlers</a> ，它的本质还是定义<code>JavaType</code> 如何转成 <code>SqlType</code> 。这个并没有什么难的，可以参考 <a href="https://github.com/zzyongx/c-gist/tree/master/java/howto">spring-howto</a> 中的样例代码， <code>LocalDateTimeTypeHandler</code> 和 <code>EnumValueTypeHandler</code> 。
</p>

<p>
这里特别说一下Enum类型，默认是 <code>EnumTypeHandler</code> ，转成enum转成字符串存入数据库。为了优化考虑，可能会想要把enum转成数字存入数据库，这时会选择 <code>EnumOrdinalTypeHandler</code> ，但这是一个陷阱。因为Enum自身的原因，在增删了Enum元素之后，对应的ordinal是会变的。可以考虑样例代码中的 <code>EnumValueTypeHandler</code> ，它可以给每个Enum元素绑定一个数字值。
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 缓存</h2>
<div class="outline-text-2" id="text-6">
<p>
Mybatis 可以配置二级缓存，但是我认为基本是鸡肋。缓存主要面临两个问题，而这两个问题，Mybatis都没有很好的解决。
</p>

<ul class="org-ul">
<li>缓存的KEY是什么，也即如何选择缓存粒度？
</li>
<li>何时清理缓存，也即如何保持数据一致性？
</li>
</ul>

<p>
一条查询SQL执行成功，如果需要缓存结果，那么选择什么当KEY呢？直观的选择是拿SQL语句当KEY，可是数据变更时，如何清理缓存呢？变更数据的SQL显然不知道有哪些相关的查询SQL需要被清理，所以只能清理掉所有缓存（这正是MySQL自身的查询缓存策略，而在实践中是推荐关掉MySQL的查询缓存的），或者不清理任何缓存，让数据过期，容忍短暂的数据不一致。
</p>

<p>
Mybatis 正是用查询SQL当缓存的KEY，当有变更数据的SQL发生时，清理掉所有缓存。在高并发的情况下，这种缓存策略对性能提升有限，而并发不高时，用缓存根本没有意义。
</p>

<p>
有缓存需求时，可以考虑在DAO之上封装一层，可以采用数据库行的PRIMARY KEY作为缓存，粒度较细。并且更新总是可以根据PRIMARY KEY更新。缓存总是带来复杂度的提升，优先考虑优化查询和数据库，缓存带来的好处非常显然时，再考虑使用缓存，并且要谨慎选择缓存的KEY。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zzyong wangwenlong</p>
<p class="date">Created: 2016-03-31 四 10:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
